cucmv2/roles/CUCM_axl_setup/files/AxlCmds/AXL_verifyActivatedServices.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://schemas.cisco.com/ast/soap">
   <soapenv:Header/>
   <soapenv:Body>
      <soap:soapGetServiceStatus>
          <soap:ServiceStatus>Cisco CallManager</soap:ServiceStatus>
          <soap:ServiceStatus>Cisco Tftp</soap:ServiceStatus>
          <soap:ServiceStatus>Cisco CTL Provider</soap:ServiceStatus>
          <soap:ServiceStatus>Cisco Certificate Authority Proxy Function</soap:ServiceStatus>
          <soap:ServiceStatus>Cisco DirSync</soap:ServiceStatus>
          <soap:ServiceStatus>Cisco Bulk Provisioning Service</soap:ServiceStatus>
          <soap:ServiceStatus>Cisco AXL Web Service</soap:ServiceStatus>
          <soap:ServiceStatus>Cisco SOAP - CDRonDemand Service</soap:ServiceStatus>
          <soap:ServiceStatus>Cisco CAR Web Service</soap:ServiceStatus>
      </soap:soapGetServiceStatus>
   </soapenv:Body>
</soapenv:Envelope>

