ccm/axl/queries/ControlServiceRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
xmlns:soap="http://schemas.cisco.com/ast/soap">
   <soapenv:Header/>
   <soapenv:Body>
      <soap:soapDoControlServices>
         <soap:ControlServiceRequest>
            <soap:NodeName></soap:NodeName>
            <soap:ControlType>Restart</soap:ControlType>
            <soap:ServiceList>
               <!--Zero or more repetitions:-->
               <soap:item>{{service}}</soap:item>
            </soap:ServiceList>
         </soap:ControlServiceRequest>
      </soap:soapDoControlServices>
   </soapenv:Body>
</soapenv:Envelope>
